//
//  GameSettingModel.swift
//  Spy-game
//
//  Created by Сергей on 22.03.2022.
//

import Foundation

class GameSetting {
    var playerAmmount: Int = 4
    var spyAmmount: Int = 1
    var timeDuring: Int = 5
    var roles: Bool = false
    var selectedLocations: [String] = ["Базовые"]
    
    var players: [String] = []
    
    var locations : [String:[String]] = ["Базовые":Locations().main,
                                         "Страны" : Locations().countries,
                                         "Города России" : Locations().russianCities,
                                         "Достопримечательности" : Locations().attractions,
                                         "Природа" : Locations().nature,
                                         "Планеты" : Locations().planets,
                                         "Фильмы" : Locations().movies,
                                         "Строго 18+" : Locations().sex,
                                        ]
}

struct Locations {
    let main:[String] = ["Отель", "Больница", "Пиратский корабль", "Полицейский участок", "Театр", "Ресторан", "Школа", "Магазин", "Подводная лодка", "Самолет", "Университет", "Церковь", "Казино", "Пляж", "Воинская часть"]
    let countries: [String] = ["США", "Канада", "Мексика", "Бразилия", "Германия", "Франция", "Австралия", "Беларусь", "Украина", "Россия", "Грузия", "Израиль", "Турция", "Египет", "Китай"]
    let russianCities: [String] = ["Москва", "Санкт-Петербург", "Сочи", "Нижний Новгород", "Екатеринбург", "Калининград", "Владимир", "Казань", "Тула", "Владивосток", "Ростов-на-Дону", "Волгоград", "Рязань", "Новосибирск", "Воркута"]
    let attractions: [String] = ["Пирамиды", "Китайская стена", "Статуя свободы", "Тадж-Махал", "Эйфелева башня", "Колизей", "Биг-Бен", "Стоунхендж", "Сиднейский театр", "Ниагарский водопад"]
    let nature: [String] = ["Лес", "Поле", "Озеро", "Пустныня", "Океан", "Джунгли", "Вулкан", "Болото", "Ледник"]
    let planets: [String] = ["планета Меркурий", "планета Венера", "планета Земля", "планета Марс", "планета Сатурн", "планета Юпитер", "планета Уран", "планета Нептун", "планета Плутон", "звезда Солнце", "спутник Луна"]
    let movies: [String] = ["ф.Властелин Колец", "ф. Терминатор", "ф. Форест Гамп", "ф. Крестный отец", "ф. Зеленая миля", "ф. Титаник", "ф. Матрица", "ф. Назад в Будущее", "ф. Бэтмен", "ф. Гладиатор", "ф. Аватар", "ф. 1+1", "ф. Мстители", "ф. Начало", "ф. Парк Юрского периода", "ф. Интерстеллар"]
    let sex:[String] = ["Бордель", "Стриптиз", "Гей-оргия", "Вечеринка свингеров", "Сексшоп", "Порностудия", "Порнокастинг", "Гос. дума", "Ночной клуб", "Концерт Стаса Михайлова", "Зона"]
}

struct Roles {
    let hotelRoles: [String] = ["Консьерж, Уборщик, Горничная, Техник, Повар, Официант, Охранник, Управляющий, Владелец отеля"]
    let hospitalRoles: [String] = ["Санитар, Медсестра, Фельдшер, Главврач, Ортопед, Хирург, Физиолог, Физиотерапевт, Терапевт, Лор, Рентгенолог, Проктолог"]
    let boatRoles: [String] = ["Капитан, Боцман, Шкипер, Плотник, Корабельный врач, Моряк, Пассажир, Кок, Канонир"]
    let policeRoles: [String] = ["Участковый, Начальник отделения, Прапорщик, Уборщик, Криминалист, Оперативник, Росгвардеец, Задержанный, Задержанный"]
    let theaterRoles: [String] = ["Актёр, Актер, Режиссёр, Дирижёр, Балетмейстер, Сценарист, Композитор, Хореограф, Костюмер, Гримёр"]
    let restRoles: [String] = ["Владелец, Администратор, Официант, Официант, Бармен, Бариста, Кассир, Уборщик, Посетитель"]
    let schoolRoles: [String] = ["Директор, Завуч, Учитель математики, Учитель физики, Учитель биологии, Учитель истории, Физрук, Санитар, Ученик, Школьник, Учитель ОБЖ"]
    let marketRoles: [String] = ["Директор, Администратор, Бухгалтер, Продавец, Консультант, Кассир, Техник, Покупатель, Посетитель"]
    let underwaterBoatRoles: [String] = ["Командир, Рулевой, Заряжающий, Матрос, Мичман, Помощник командира, Навигатор, Техник, Инженер, Связист"]
    let airplaneRoles: [String] = ["Главный пилот, Помощник пилота, Бортпроводник, Бортпроводник, Стюард, Стюард, Стюард, Пассажир бизнеса, Пассажир эконома, Багаж :)"]
    let universityRoles: [String] = ["Ректор, Проректор, Главный бухгалтер, Экономист, Руководитель каферды, Преподаватель, Лаборант, Адьютант, Студент, Студент, Студент"]
    let churchRoles: [String] = ["Патриарх, Митрополит, Епископ, Священник, Дьякон, Прихожанин, Прихожанин, Прихожанин, Прихожанин, Пастырь"]
    let casinoRoles: [String] = ["Гениральный директор, Директор Казино, Директор бара, Директор охраны, Бармен, Официант, Охранник, Крупье, Крупье, Посетитель, Посетитель"]
    let beachRoles: [String] = ["Пьяный турист, Торговец курурузой, Спасатель, Мачо, Сгоревший турист, Турист, Спящий турист, Голый турист, Турист в маске, Любитель понырять"]
    let militaryRoles: [String] = ["Командир, Заместитель командира, Старщий прапорщик, Прапорщик, Солдат, Солдат, Солдат, Солдат, Командир взвода, Командир Роты, Контрактник, Водитель, Повар в столовой"]
    
}
