//
//  GameSettingModel.swift
//  Spy-game
//
//  Created by Сергей on 22.03.2022.
//

import Foundation

class GameSetting {
    var playerAmmount: Int = 4
    var spyAmmount: Int = 1
    var timeDuring: Int = 5
    var roles: Bool = false
    var selectedLocations: [String] = ["Базовые"]
    
    var players: [String] = ["Юля", "Юса", "Я", "Сергей"]
    
    var locations : [String:[String]] = ["Базовые":Locations().main,
                                         "Страны" : Locations().countries,
                                         "Города России" : Locations().russianCities,
                                         "Достопримечательности" : Locations().attractions,
                                         "Природа" : Locations().nature,
                                         "Планеты" : Locations().planets,
                                         "Фильмы" : Locations().movies,
                                         "Строго 18+" : Locations().sex,
                                        ]
}

struct Locations {
    let main:[String] = ["Отель", "Больница", "Пиратский корабль", "Полицейский участок", "Театр", "Ресторан", "Школа", "Магазин", "Подводная лодка", "Самолет", "Университет", "Церковь", "Казино", "Пляж", "Воинская часть"]
    let countries: [String] = ["США", "Канада", "Мексика", "Бразилия", "Германия", "Франция", "Австралия", "Беларусь", "Украина", "Россия", "Грузия", "Израиль", "Турция", "Египет", "Китай"]
    let russianCities: [String] = ["Москва", "Санкт-Петербург", "Сочи", "Нижний Новгород", "Екатеринбург", "Калининград", "Владимир", "Казань", "Тула", "Владивосток", "Ростов-на-Дону", "Волгоград", "Рязань", "Новосибирск", "Воркута"]
    let attractions: [String] = ["Пирамиды", "Китайская стена", "Статуя свободы", "Тадж-Махал", "Эйфелева башня", "Колизей", "Биг-Бен", "Стоунхендж", "Сиднейский театр", "Ниагарский водопад"]
    let nature: [String] = ["Лес", "Поле", "Озеро", "Пустныня", "Океан", "Джунгли", "Вулкан", "Болото", "Ледник"]
    let planets: [String] = ["планета Меркурий", "планета Венера", "планета Земля", "планета Марс", "планета Сатурн", "планета Юпитер", "планета Уран", "планета Нептун", "планета Плутон", "звезда Солнце", "спутник Луна"]
    let movies: [String] = ["ф.Властелин Колец", "ф. Терминатор", "ф. Форест Гамп", "ф. Крестный отец", "ф. Зеленая миля", "ф. Титаник", "ф. Матрица", "ф. Назад в Будущее", "ф. Бэтмен", "ф. Гладиатор", "ф. Аватар", "ф. 1+1", "ф. Мстители", "ф. Начало", "ф. Парк Юрского периода", "ф. Интерстеллар"]
    let sex:[String] = ["Бордель", "Стриптиз", "Гей-оргия", "Вечеринка свингеров", "Сексшоп", "Порностудия", "Порнокастинг", "Гос. дума", "Ночной клуб", "Концерт Стаса Михайлова", "Зона"]
    
}
